snlkuharlocal/src/Documents/ОплатаЧерезККМ/ОплатаЧерезККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЧерезККМ</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.АвансыЧерезККМ</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатыЧерезККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПробитНаККМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьБумажныйЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/АвансыЧерезККМ/АвансыЧерезККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АвансыЧерезККМ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ТипыОплатыЧерезККМ/ТипыОплатыЧерезККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатыЧерезККМ</name>
  <enumValues>
    <name>ОплатаЗаОтгруженныйТовар</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеАванса</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАванса</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ОплатаЧерезККМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ПолучениеАванса Тогда
		Движение = Движения.АвансыЧерезККМ.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.ВидОплаты = ВидОплаты;
		Движение.Сумма = Всего;
	КонецЕсли;
	Если ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ЗачетАванса Тогда
		Движение = Движения.АвансыЧерезККМ.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.ВидОплаты = ВидОплаты;
		Движение.Сумма = Всего;
	КонецЕсли;
	
	Движения.АвансыЧерезККМ.Записать(Истина);	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	#Если Клиент тогда
		Если ПараметрыСеанса.КассаККМ.Пустая() Тогда	
			Предупреждение("На данном рабочем месте не подлючен ФР или не установлена касса по умолчанию !");
			Возврат;
		КонецЕсли;
	#КонецЕсли	 
		
		КассаККМ = ПараметрыСеанса.КассаККМ;
		Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение;
	Если ДанныеЗаполнения = Неопределено Тогда
	 ВидОплаты = Перечисления.ВидыОплаты.НАЛ;
	ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ПолучениеАванса;
		Иначе
	ДокОснование = ДанныеЗаполнения;
	ВидОплаты = Перечисления.ВидыОплаты.НАЛ;
	ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ОплатаЗаОтгруженныйТовар;
	Контрагент = ДокОснование.Контрагент;
	Договор = ДокОснование.Договор;
	АдресЭлектроннойПочты = Контрагент.ЕМэйл1;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	-ОплатаЧерезККМТовары.Всего КАК Всего,
	               |	ОплатаЧерезККМТовары.Номенклатура КАК Номенклатура,
	               |	-ОплатаЧерезККМТовары.Количество КАК Количество
	               |ИЗ
	               |	Документ.ОплатаЧерезККМ.Товары КАК ОплатаЧерезККМТовары
	               |ГДЕ
	               |	ОплатаЧерезККМТовары.Ссылка.ДокОснование = &ДокОснование
	               |	И ОплатаЧерезККМТовары.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РНКТовары.Всего,
	               |	РНКТовары.Номенклатура,
	               |	РНКТовары.Количество
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товары КАК РНКТовары
	               |ГДЕ
	               |	РНКТовары.Ссылка = &ДокОснование
	               |	И РНКТовары.Ссылка.Проведен ";
	
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	ТаблицаОтгрузки = Запрос.Выполнить().Выгрузить();
	ТаблицаОтгрузки.Свернуть("Номенклатура","Всего,Количество");
	
	КоличествоСтрокВДокументе = 0;
	Для Каждого СтрокаТЧ Из ТаблицаОтгрузки Цикл
	
		Если СтрокаТЧ.Всего > 0 Тогда
			
			Если КоличествоСтрокВДокументе >= 100 Тогда
				 Всего = Товары.Итог("Всего"); 
				Прервать;			
			КонецЕсли;
	НоваяСтрокаТоваров = Товары.Добавить();
	НоваяСтрокаТоваров.Номенклатура = СтрокаТЧ.Номенклатура;
	НоваяСтрокаТоваров.Всего = СтрокаТЧ.Всего;
	//крохин начало 31.10.2019
	//опечатка
	Если НоваяСтрокаТоваров.Количество < 1 Тогда
	//Если СтрокаТЧ.Количество .Количество < 1 Тогда
	//крохин конец 31.10.2019	
		НоваяСтрокаТоваров.Количество = 1;
	Иначе
		НоваяСтрокаТоваров.Количество = СтрокаТЧ.Количество;
	КонецЕсли;
	НоваяСтрокаТоваров.Цена = НоваяСтрокаТоваров.Всего/НоваяСтрокаТоваров.Количество;
КонецЕсли;

КоличествоСтрокВДокументе = КоличествоСтрокВДокументе + 1;
	
	//крохин начало 11.11.2019
	//иногда цена*количество <> всего, тогда надо выделять 1 шт.
	Если НоваяСтрокаТоваров.Цена *  НоваяСтрокаТоваров.Количество <> НоваяСтрокаТоваров.Всего Тогда
		Если НоваяСтрокаТоваров.Количество = 1 Тогда
			НоваяСтрокаТоваров.Цена = НоваяСтрокаТоваров.Всего ;
		Иначе
			 НоваяСтрокаТоваров.Количество = НоваяСтрокаТоваров.Количество - 1;
			 БылоВсего = НоваяСтрокаТоваров.Всего;
			 НоваяСтрокаТоваров.Всего = НоваяСтрокаТоваров.Количество * НоваяСтрокаТоваров.Цена;
			 СталоВсего = НоваяСтрокаТоваров.Всего;
	НоваяСтрокаТоваров = Товары.Добавить();
	НоваяСтрокаТоваров.Номенклатура = СтрокаТЧ.Номенклатура;
	НоваяСтрокаТоваров.Количество = 1;
	НоваяСтрокаТоваров.Цена = БылоВсего - СталоВсего;
	НоваяСтрокаТоваров.Всего = НоваяСтрокаТоваров.Цена;
	КоличествоСтрокВДокументе = КоличествоСтрокВДокументе + 1;
		КонецЕсли;
	КонецЕсли;
	//крохин конец 11.11.2019


    КонецЦикла;

	ТаблицаТоваров = Товары.Выгрузить();
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
	СтрокаТЧ.Номенклатура = СтрокаТЧ.Номенклатура.Родитель;	
    КонецЦикла;
    ТаблицаТоваров.Свернуть("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("НомерГТД");
	Для Каждого СтрокаТН Из ТаблицаТоваров Цикл
	ГТД = ПолучитьГрупповойПериодическийРеквизит(СтрокаТН.Номенклатура,"НомерГТД",ДокОснование.Дата);
	СтрокаТН.НомерГТД = ГТД;
	КонецЦикла;
	Для каждого СтрокаТЧ ИЗ Товары Цикл
		ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("Номенклатура", СтрокаТЧ.Номенклатура.Родитель);
    НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(ПараметрыОтбора);
    Если НайденныеСтроки.Количество()>0 Тогда
				СтрокаТЧ.НомерГТД=НайденныеСтроки[0].НомерГТД;
	КонецЕсли;

КонецЦикла;
Всего = Товары.Итог("Всего");
КонецЕсли;
 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);
	КонецЕсли;	
	
     Если НужноВыгружать Тогда
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЧекПробитНаККМ = Ложь;
	ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ПолучениеАванса;
	Товары.Очистить();
	ДокОснование = Неопределено;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
